W7D5/RedditCloneApp/app/controllers/application_controller.rb

  def require_moderator
    sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]