W7D5/RedditCloneApp/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "created_at", "updated_at", "moderator_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @sub = Sub.find(params[:id])