W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

  def create
    cat = Cat.new(cat_params)

    if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    cat = Cat.find(params[:id])

    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "New_Cat_2"], ["sex", "F"], ["description", "This is the second cat created through a form"], ["updated_at", "2020-05-15 23:01:23.027894"], ["id", 16]]