W7D5/RedditCloneApp/app/views/posts/show.html.erb

<% @post ||= Post.find(params[:id]) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]