W6D4/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artworks"."artist_id" = $1 AND "artwork_shares"."viewer_id" = $2  [["artist_id", 6], ["viewer_id", "6"]]
---
  def index
    artworks = Artwork
                .joins(:artist)
                .where(artist_id: params[:user_id])

    shared_artworks = User
                        .select("artworks.*")
                        .joins(:shared_artworks)
                        .where(artwork_shares: {viewer_id: params[:user_id]})

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
---
  def destroy
    artwork = Artwork.find(params[:id])
    if artwork.destroy