W6D4/art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
  def index
    if params.has_key?(:user_id)
      comments = Comment.where(user_id: params[:user_id])
    elsif params.has_key?(:artwork_id)
      comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("body", "artwork_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Interesting"], ["artwork_id", 1], ["user_id", 3], ["created_at", "2020-05-14 19:03:00.479741"], ["updated_at", "2020-05-14 19:03:00.479741"]]
---
  def create
    comment = Comment.new(comment_params)

    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    comment = Comment.find(params[:id])

    if comment.destroy