W6D4/art_share_api/app/controllers/users_controller.rb

  def index
    if params.has_key?(:query)
      users = User.where("username ILIKE ?", "%#{params[:query]}%")
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" IS NULL
SELECT "users".* FROM "users"