W7D5/RedditCloneApp/app/views/subs/edit.html.erb


<% @sub ||= Sub.find(params[:id]) %>
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]