W7D5/RedditCloneApp/app/views/subs/show.html.erb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% @sub ||= Sub.find(params[:id]) %>

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
---
<h3>Posts:</h3>
<% @sub.posts.each do |post| %>